#!/usr/bin/env python3
# -*- coding:utf-8 -*-
# @Time :2021-3-31 9:40
# @Author:xinggevip
# @File : dangan.py
# @Software: PyCharm

# 输入数字几，就找到出现几次的元素
list = ["台式电脑","台式电脑(单主机)","笔记本电脑","防火墙","交换机","路由器","AC控制器","AP","ONU光纤接入设备","光纤收发器","VPN","语音网关","服务器","硬盘录像机","监控摄像头","小型复合机","大型复合机","标签打印机","彩色打印机","激光打印机","针式打印机","保险柜","装订机","碎纸机","点钞机","对讲机","手机","耳麦电话机","电话座机","录音电话","大灵通","呼叫中心电话","移动硬盘","数据采集器","平板电脑","数码摄像机","数码相机","投影仪","高拍仪","扫描仪","过塑机","无线麦克风","功放","音箱","活动音响(套)","全向麦克","视频会议摄像头","电话录音盒/卡","考勤机","红外报警器","传真机","电子计价秤","显示器","电话录音系统","车辆检测仪","KVM切换器","UPS","蓄电池","稳压器","违章处理自助终端","业务受理终端","自助选号终端机","广告机","伸缩门","道闸系统","LED屏","车间普通工具","车间专用工具","热风枪","塑料焊枪","热熔胶枪","电钻/冲击钻","电动冲击起子","打磨抛光机","角磨机","电鼓","气缸压力表","柴油气缸压力表","喷枪","燃油压力表","机油压力表","内径百分表","电瓶测试仪","卤素检测仪","冰点检测仪","平板车","千斤顶","变速箱托架","发动机吊架","避震弹簧拆装机","安全支架","压力机","梯子","高压令克棒","油桶","手动液压叉车","工具车","美容车","裁膜台","电瓶线","机油加注器","拉出器","气鼓","气动扳手（风炮）","切割机","打包机","丝杆减震器","臭氧机","烤漆灯","气泵","洗车机","工业吸尘器","泡沫机","甩干机","充电机","发电机","真空泵","冷媒加注机","氮气机","轮胎动平衡机","四轮定位仪","轮胎拆装机","二氧化碳保护焊机","气动接油机","气动刹车油更换机","接油机","钣金整形修复机","无尘干磨机","剪式举升机","龙门举升机","大梁校正仪","烤漆房","螺杆式空压机","储气罐","干燥器","精密过滤器","尾排风扇","废气排放系统","烤漆环保设备","电气焊","电池举升机","绝缘耐压测试仪","绝缘电阻测试仪","充电桩","充电立柱","叉车","电梯","物流车","试驾车","工作车","救援车","高层配车","装饰瓶","风水装饰物","按摩椅","游戏桌","篮球架","乒乓球台","台球桌","动感单车","儿童车","支架（通用）","展示柜","展架","货架","茶水/饮料推车","婴儿床","幕布","机柜","立式不锈钢垃圾桶","户外垃圾桶","洗手台","报刊架","雨伞架","办公桌","办公椅","沙发","文件柜","工具柜","储物柜","资料架","抽屉柜","演讲台","白板","床","衣架","员工餐具柜","茶几","鱼缸","形象墙","吧台","空气净化器","茶台","燃气取暖器","落地扇","电饼铛","钟表","电热汀","空调扇","电扇","工业扇","电暖扇","吸尘器","挂烫机","饮水机","空气净化器","电视机","冰箱","冷柜","热水器","空调","洗衣机","爆米花机","擦鞋机","微波炉","咖啡机","消毒柜","烤肠机","仓库灯","电磁炉","保温桶","电动自行车","和面机","馒头成型机","切肉机","餐厅抽油烟机","餐厅电蒸箱/柜","餐厅灶台","餐厅消毒柜","餐厅冷冻柜","餐厅油烟处理系统","餐桌","餐椅","留样柜","餐厅储碗柜","保温工作台","餐厅工作台","餐厅置物架","餐厅食品柜","财务软件","OA管理软件","销售管理软件"]
b = set(list)
for each_b in b:
    count = 0
    for each_a in list:
        if each_b == each_a:
            count += 1
    if count > 1:
        print(each_b, ": ", count)
    
