#!/usr/bin/env python3
# -*- coding:utf-8 -*-
# @Time :2021-3-30 9:40
# @Author:xinggevip
# @File : dangan.py
# @Software: PyCharm

"""
找出相同和不同的数据
"""

str1 = "获取到的字段"
str2 = "需要取的字段"

list1 = ['$','姓名','身份证号','出生日期','性别','年龄','身高','体重','民族','学历','政治面貌','婚姻状况','户口省'
,'户口市','身份证住址','现居住地','手机号码','紧急联系人','联系人关系','联系人电话','开户银行','人员编号','招聘来源'
,'员工状态','现职单位','现职部门','现职岗位','现职级','工龄年','工龄月','社保状态','银行卡号','现薪资'
,'社保挂靠单位','劳动合同到期','入职日期','转正日期','离职日期','人才回流','保险到期','复职次数','紧急联系人/关系/电话'
,'户口地','家庭联系方式','人员异动','year','month','day','调动/离职日期','原调入公司','原调入部门'
,'原调入岗位','调出/晋升公司','调出/晋升部门','调出/晋升岗位','异动/离职类型','调动原因','离职原因','liyear'
,'limonth','liday','合同签订记录','档案/合同存放地','是否购买商业险','保险期限','商业险购买日期','保险机构'
,'缴纳险种','是否缴纳五险','参保时间','用工性质','毕业院校']

list2 = ["现职单位","现职部门","现职岗位","现职级","员工状态","姓名","出生日期","民族","学历","身份证号","手机号码",
                      "政治面貌","婚姻状况","有无子女","家庭联系方式","身份证住址","户口地","现居住地","紧急联系人/关系/电话",
                      "用工性质","人员异动","入职日期","招聘来源","转正日期","调动/离职日期","原调入公司","原调入部门",
                      "原调入岗位","调出/晋升公司","调出/晋升部门","调出/晋升岗位","异动/离职类型","调动原因","离职原因",
                      "人员编号","合同签订记录","档案/合同存放地","是否购买商业险","保险机构","缴纳险种","保险期限","是否缴纳五险",
                      "参保时间","年龄","工龄年","性别","毕业院校"]
list3 = []
list4 = []

for i in list1:
    for j in list2:
        if i == j:
            list3.append(i)

for b in (list1 + list2):
    if b not in list3:
        if b not in list2:
            print(b,"-------",str1,"有，",str2,"没有")
        if b not in list1:
            print(b,"-------",str2,"有，",str1,"没有")
        list4.append(b)

print(list3)
print(list4)

